performance/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Normal load"
    - duration: 60
      arrivalRate: 100
      name: "Peak emergency load"
  processor: "./performance/custom-functions.js"

scenarios:
  - name: "Emergency incident reporting"
    weight: 40
    flow:
      - get:
          url: "/civilian-portal-hero"
      - post:
          url: "/api/incidents"
          json:
            type: "medical"
            severity: "high"
            location: "Downtown Community Center"
            description: "Cardiac emergency"

  - name: "Real-time coordination"
    weight: 30
    flow:
      - get:
          url: "/responder-portal-hero"
      - get:
          url: "/api/incidents"

  - name: "Community reporting"
    weight: 20
    flow:
      - get:
          url: "/incident-reporting"
      - post:
          url: "/api/communications"
          json:
            message: "Fire spotted near highway"
            priority: "high"

  - name: "Government oversight"
    weight: 10
    flow:
      - get:
          url: "/government-dashboard"
      - get:
          url: "/api/emergency-resources"